#include <stdio.h>

void main() {
	int coin; // 입력받을 금액을 저장할 변수
	int count; // 동전 개수를 저장할 변수
	printf("금액을 입력하세요 : "); // 금액 입력  안내문
	scanf_s("%d", &coin); // 금액 입력 받음
	if (coin >= 500) {
		// 입력받은 금액이 500보다 크면
		count = coin / 500;
		// 금액을 500으로 나누어 필요한 동전의 개수를 count에 저장
		coin = coin - count * 500;
		// coin에서 500원으로 지급 가능한 금액 빼기
		printf("500원으로 지급 가능한 금액 : %d원\n", count * 500);
		// 500원으로 지급 가능한 금액 출력
	}
	if (coin >= 100) {
		/*
		 500보다 큰 것은 위의 if문에 걸렸을 것이므로
		 500보다 작고 100보다 큰 금액이 남았을 때 조건 만족
		*/
		count = coin / 100;
		// 금액을 100으로 나누어 필요한 동전의 개수를 count에 저장
		coin = coin - count * 100;
		// coin에서 100원으로 지급 가능한 금액 빼기
		printf("100원으로 지급 가능한 금액 : %d원\n", count * 100);
		// 100원으로 지급 가능한 금액 출력
	}
	if (coin >= 50) {
		/*
		 100보다 큰 것은 위의 if문에 걸렸을 것이므로
		 100보다 작고 50보다 큰 금액이 남았을 때 조건 만족
		*/
		count = coin / 50;
		// 금액을 50으로 나누어 필요한 동전의 개수를 count에 저장
		coin = coin - count * 50;
		// coin에서 50원으로 지급 가능한 금액 빼기
		printf("50원으로 지급 가능한 금액 : %d원\n", count * 50);
		// 50원으로 지급 가능한 금액 출력
	}
	if (coin >= 10) {
		/*
		 50보다 큰 것은 위의 if문에 걸렸을 것이므로
		 50보다 작고 10보다 큰 금액이 남았을 때 조건 만족
		*/
		count = coin / 10;
		// 금액을 10으로 나누어 필요한 동전의 개수를 count에 저장
		coin = coin - count * 10;
		// coin에서 10원으로 지급 가능한 금액 빼기
		printf("10원으로 지급 가능한 금액 : %d원\n", count * 10);
		// 10원으로 지급 가능한 금액 출력
	}
	if (coin >= 1) {
		printf("1원으로 지급 가능한 금액 : %d원", coin);
		// 금액이 남았다면 10원보다 적을 것이므로, 남은 금액 모두는 1원으로 지급
	}
}